docs/1c-export-2026-06-02/Catalogs/Весы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Весы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлам</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Погрешность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

docs/1c-export-2026-06-02/Catalogs/Весы/Ext/ManagerModule.bsl
Функция ПолучитьДанныеВесов(Данные) Экспорт 
	
	ВесТовара 		= 0;
	Если НЕ ПустаяСтрока(Данные) Тогда 
		ВесСтрока 		= "";
		ВесПрочитан 	= Ложь;
		НомерБайта 		= 1;
		ВсегоБайт 		= СтрДлина(Данные);
		СлужебныхБайт 	= 4;
		Пока НомерБайта <= ВсегоБайт Цикл
			Если НомерБайта <= СлужебныхБайт Тогда
				НомерБайта = НомерБайта + 1;
				Продолжить;
			КонецЕсли;
			ВесСтрока  = ВесСтрока + СокрЛП(Сред(Данные, НомерБайта, 1));
			НомерБайта = НомерБайта + 1;
		КонецЦикла;	
		ВесТовара = Число(ВесСтрока);
	КонецЕсли;
	
	Возврат ВесТовара;
	
КонецФункции

Процедура ВзвеситьТовар() Экспорт 
	
	Перем rs232; 
	
	ПодключитьВесы(rs232);
	
	Если rs232.Ошибка <> "" Тогда 
		Возврат;
	КонецЕсли;	
	
	Если НЕ rs232 = Неопределено Тогда 
		Попытка
			rs232.ЗаписатьСтроку("G01W"+Символы.CR + Символы.LF);
		Исключение
		КонецПопытки;	
	КонецЕсли;	
	
	ЗакрытьПорт(rs232);
	
КонецПроцедуры	

Процедура ПодключитьВесы(rs232)
	
	мТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	Весы 				 = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(мТекущийПользователь, "ОсновныеВесы");	
	Если Весы = Справочники.Весы.ПустаяСсылка() Тогда 
		Сообщить("В настройках текущего пользователя не указаны основные весы!");
		Возврат;
	КонецЕсли;	
	ИмяФайла = Весы.ПутьКФайлам + "\vk_rs232.dll";
	Попытка 
		ЗагрузитьВнешнююКомпоненту(ИмяФайла);
		rs232 				= Новый("AddIn.vk_rs232");
		ОткрытьПорт(rs232, Весы.Порт);
		rs232.СтоповыеБиты 	= 2;
		rs232.Четность 		= 0;
	Исключение
		Сообщить("Не удалось подключить весы! Проверьте настройки справочника.");
	КонецПопытки;
	
КонецПроцедуры	

Процедура ОткрытьПорт(ComОбъект, Порт)
	
	Если Порт = ("COM1") Тогда 
		ComОбъект.ОткрытьПорт("COM1")
	ИначеЕсли Порт = ("COM2") Тогда 
		ComОбъект.ОткрытьПорт("COM2")
	ИначеЕсли Порт = ("COM3") Тогда
		ComОбъект.ОткрытьПорт("COM3")
	ИначеЕсли Порт = ("COM4") Тогда
		ComОбъект.ОткрытьПорт("COM4")
	ИначеЕсли Порт = ("COM5") Тогда
		ComОбъект.ОткрытьПорт("COM5")
	ИначеЕсли Порт = ("COM6") Тогда
		ComОбъект.ОткрытьПорт("COM6")
	ИначеЕсли Порт = ("COM7") Тогда
		ComОбъект.ОткрытьПорт("COM7")
	ИначеЕсли Порт = ("COM8") Тогда
		ComОбъект.ОткрытьПорт("COM8")
	ИначеЕсли Порт = ("\\tsclient\COM1") Тогда
		ComОбъект.ОткрытьПорт("\\tsclient\COM1")		
	ИначеЕсли Порт = ("\\tsclient\COM2") Тогда
		ComОбъект.ОткрытьПорт("\\tsclient\COM2")		
	ИначеЕсли Порт = ("\\tsclient\COM3") Тогда
		ComОбъект.ОткрытьПорт("\\tsclient\COM3")		
	ИначеЕсли Порт = ("\\tsclient\COM4") Тогда
		ComОбъект.ОткрытьПорт("\\tsclient\COM4")		
	ИначеЕсли Порт = ("\\tsclient\COM5") Тогда
		Попытка
			ComОбъект.ОткрытьПорт("\\tsclient\COM5")
		Исключение
		КонецПопытки;	
	ИначеЕсли Порт = ("\\tsclient\COM6") Тогда
		ComОбъект.ОткрытьПорт("\\tsclient\COM6")
	ИначеЕсли Порт = ("\\tsclient\COM7") Тогда
		ComОбъект.ОткрытьПорт("\\tsclient\COM7")
	ИначеЕсли Порт = ("\\tsclient\COM8") Тогда
		ComОбъект.ОткрытьПорт("\\tsclient\COM8")
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ЗакрытьПорт(rs232)
	
	Если НЕ rs232 = Неопределено Тогда 
		Попытка
			rs232.ЗакрытьПорт();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры
